In [3]:
# 1, 2, 3 더하기
# 답안
#https://tooo1.tistory.com/112

def f(x):
    if x == 3:
        return 4
    if x == 2:
        return 2
    if x == 1:
       return 1
    else:
        answer=f(x-1)+f(x-2)+f(x-3)
        return answer

T=int(input())

for _ in range(T):
    temp = int(input())
    print(f(temp))

3
4
7
7
44
10
274

In [ ]:
# Japan Population
# https://www.hackerrank.com/challenges/japan-population/problem?isFullScreen=true

select sum(population) from city where countrycode = 'jpn';

In [ ]:
# Top Earners
# https://www.hackerrank.com/challenges/earnings-of-employees/problem?isFullScreen=true

select max(m),max(c) from (select salary * months as m,count(*) as c from employee group by salary * months) as result;